
public class Today {

	
	/*
	 * ---------------------------------- 개발일지 ----------------------------------
	 * 
	 * 2020년 10월
	 * 
	 *  10-09 금
	 *  
	 *  * 개인 공부
	 *  * JAVA
	 *  - 개발일지 등록시작
	 *  - spring handler와 interceptor개념 및 웹소켓 공부
	 * 
	 * 	* 파이널 프로젝트(학원)
	 *  - 학원 파이널 프로젝트 회웝가입,아이디 비번 찾기 화면 수정
	 * 
	 *___________________________________________________________________________
	 *
	 *	10-10 토
	 *	
	 *	* 개인 공부
	 *	* JAVA
	 *	- spring-websocket을 활용한 소켓통신 공부
	 *	- 결과 정리
	 *	1. HttpSession과 WebSocketSession은 다른것
	 *	2. HttpSession의 아이디값으로 채팅기능을 구현하기 위해선 WebSocketSession과의 연결점이 필요함
	 *	3. JSP에 session=false 잘보자 이 것 때문에 하루 날렸다.(왜 세션값을 못받아오는지  ㅋㅎㅋㅎ)
	 *	
	 *	- 추후 예정
	 *	1. interceptor를 통한 세션 가로채기로 아이디값 가져와서 채팅에 사용자 아이디 넣어 채팅 구현하기
	 *	2. Spring - pojo, DTO, Porxy, shcema, spirng-context-support 공부
	 *	
	 * ___________________________________________________________________________
	 * 
	 * 10-11 일
	 * 
	 * 휴식
	 * 
	 * ___________________________________________________________________________
	 * 
	 * 10-12 월
	 * 
	 * * 개인 공부
	 * 
	 * * 파이널 프로젝트(학원)
	 * - HTML 종합 정리
	 * - DB설계 
	 * - 기능 분담
	 * 		
	 * ___________________________________________________________________________
	 * 
	 * 10-13 화
	 * * 개인공부
	 * - 스키마의 정의:
	 * 		1. DB의 구조와 제약조건에 관한 전반적인 명세를 기술한 메타데이터
	 * 		2. DB를 구성하는 개체(Entity), 속성(Attribute), 관계(Relationship)
	 * 		       및 데이터 조작 시 데이터 값들이 갖는 제약조건등에 관해 전반적으로 정의함
	 * 		3. 관점에 따라 외부,개념,내부 스키마로 나뉨
	 * 
	 * * 파이널 프로젝트(학원)
	 * - DB구상중 HTML 구현 안된부분이 있어 구현중
	 * 
	 * 써놓고 커밋을 안했다. 집중하자....
	 * 
	 * ___________________________________________________________________________
	 * 
	 * 
	 */
}
